; domain
(define (domain mytrajectoryconstraintsremover_blocksworld_problem-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :action-costs)
 (:types block)
 (:constants
   brown_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action pickup_double
  :parameters ( ?obj - block)
  :precondition (and (ontable ?obj) (handempty) (exists (?topobj - block)
 (and (on ?topobj ?obj) (clear ?topobj))))
  :effect (and (holding ?obj) (not (ontable ?obj)) (not (handempty))(forall (?topobj - block) (when (on ?topobj ?obj) (not (clear ?topobj)))) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (handempty) (ontable ?obj) (not (holding ?obj)) (when (not (exists (?topobj - block)
 (on ?topobj ?obj))) (clear ?obj))(forall (?topobj - block) (when (on ?topobj ?obj) (clear ?topobj))) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (not (exists (?topobj - block)
 (on ?topobj ?obj))) (clear ?obj))(forall (?topobj - block) (when (on ?topobj ?obj) (clear ?topobj))) (when (exists (?y - block)
 (or (and (= ?obj brown_block_1) (= ?underobj ?y)) (on brown_block_1 ?y))) (hold_0)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (exists (?y - block)
 (and (on brown_block_1 ?y) (not (and (= ?obj brown_block_1) (= ?underobj ?y))))) (hold_0)) (increase (total-cost) 1)))
 (:action unstack_double
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (handempty) (exists (?topobj - block)
 (and (on ?topobj ?obj) (clear ?topobj))))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (handempty))(forall (?topobj - block) (when (on ?topobj ?obj) (not (clear ?topobj)))) (when (exists (?y - block)
 (and (on brown_block_1 ?y) (not (and (= ?obj brown_block_1) (= ?underobj ?y))))) (hold_0)) (increase (total-cost) 1)))
)

; problem
(define (problem mytrajectoryconstraintsremover_blocksworld_problem-problem)
 (:domain mytrajectoryconstraintsremover_blocksworld_problem-domain)
 (:objects
   green_block_1 blue_block_1 orange_block_1 blue_block_2 black_block_1 black_block_2 black_block_3 green_block_2 green_block_3 green_block_4 green_block_5 green_block_6 green_block_7 green_block_8 green_block_9 green_block_10 brown_block_2 brown_block_3 brown_block_4 brown_block_5 brown_block_6 brown_block_7 brown_block_8 brown_block_9 brown_block_10 blue_block_3 blue_block_4 blue_block_5 blue_block_6 blue_block_7 blue_block_8 blue_block_9 blue_block_10 blue_block_11 orange_block_2 orange_block_3 orange_block_4 orange_block_5 orange_block_6 orange_block_7 orange_block_8 orange_block_9 orange_block_10 black_block_4 black_block_5 black_block_6 black_block_7 black_block_8 black_block_9 black_block_10 black_block_11 black_block_12 red_block_1 red_block_2 red_block_3 red_block_4 red_block_5 red_block_6 red_block_7 red_block_8 red_block_9 red_block_10 yellow_block_1 yellow_block_2 yellow_block_3 yellow_block_4 yellow_block_5 yellow_block_6 yellow_block_7 yellow_block_8 yellow_block_9 yellow_block_10 - block
 )
 (:init (ontable green_block_1) (ontable brown_block_1) (ontable blue_block_1) (on orange_block_1 blue_block_1) (ontable blue_block_2) (on black_block_1 orange_block_1) (on black_block_2 blue_block_2) (on black_block_3 black_block_2) (clear green_block_1) (clear brown_block_1) (clear black_block_1) (clear black_block_3) (handempty) (= (total-cost) 0))
 (:goal (and (exists (?x - block)
 (and (on blue_block_2 ?x) (on ?x brown_block_1))) (hold_0)))
 (:metric minimize (total-cost))
)

; plan
1. (pickup brown_block_1)
   deleted: (clear brown_block_1) (ontable brown_block_1) (handempty)
   added: (holding brown_block_1)
   goals met: 0 of 2
2. (stack brown_block_1 black_block_1)
   deleted: (clear black_block_1) (holding brown_block_1)
   added: (handempty) (on brown_block_1 black_block_1) (clear brown_block_1) (hold_0)
   goals met: 1 of 2
3. (unstack black_block_3 black_block_2)
   deleted: (on black_block_3 black_block_2) (clear black_block_3) (handempty)
   added: (holding black_block_3) (clear black_block_2)
   goals met: 1 of 2
4. (stack black_block_3 brown_block_1)
   deleted: (clear brown_block_1) (holding black_block_3)
   added: (handempty) (on black_block_3 brown_block_1) (clear black_block_3)
   goals met: 1 of 2
5. (pickup_double blue_block_2)
   deleted: (ontable blue_block_2) (handempty) (clear black_block_2)
   added: (holding blue_block_2)
   goals met: 1 of 2
6. (stack blue_block_2 black_block_3)
   deleted: (clear black_block_3) (holding blue_block_2)
   added: (handempty) (on blue_block_2 black_block_3) (clear black_block_2)
   goals met: 2 of 2
